Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_SwiftProgrammingLanguage_ePub5.2/Swift_ePub_SPL-omegat.tmx
Source language: en_us
Languages: ja

source: Although the property name is an expression, it is never evaluated.
ja: property name（プロパティ名）は式であるけれども、それは決して評価されません。

source: Although the actual execution order of pattern-matching operations, and in particular the evaluation order of patterns in cases, is unspecified, pattern matching in a switch statement behaves as if the evaluation is performed in source order—that is, the order in which they appear in source code.
ja: けれどもパターンマッチ操作の実際の実行順序、とりわけケース節の中のパターンの評価順序は指定されません、switch文のパターンマッチングはまるでその評価がソース順 ― すなわち、それらがソース・コードにおいて現れる順番、で実行されるかのようにふるまいます。

source: Although the generic where clause provides syntactic sugar for expressing simple constraints on type parameters (for example, <T: Comparable> is equivalent to <T> where T: Comparable and so on), you can use it to provide more complex constraints on type parameters and their associated types.
ja: 総称体where節は、型パラメータ上で単純な制約を表すために糖衣構文を提供しますが（例えば、<T: Comparable>は<T> where T: Comparableに等しいなどなど）、あなたはそれを使ってより複雑な制約を型パラメータとそれの関連型に提供することができます。

source: Although the indexes used to access the elements can be of any type, each parameter must include a type annotation to specify the type of each index.
ja: 要素にアクセスするために使用されるインデックスは、どんな型でも可能であるけれども、各パラメータは型注釈を含んで、各インデックスの型を指定しなければなりません。

source: Although the rest of its functionality is not shown, the purpose of this DataManager class is to manage and provide access to this array of String data.
ja: その機能性の残りの部分は示されないけれども、このDataManagerクラスの目的はこのStringデータの配列を管理して、アクセス提供することになっています。

source: Although the two forms are functionally equivalent, the shorthand form is preferred whenever possible.
ja: ２つの書式は機能的に等しいですが、可能であればいつでも略記書式が好ましいです。

source: Although the two forms are functionally identical, the shorthand form is preferred and is used throughout this guide when referring to the type of a dictionary.
ja: ２つの書式は機能的に同一であるけれども、短縮形がむしろ好まれ、このガイドを通して辞書の型に言及するときに使われます。

source: Although the two forms are functionally identical, the shorthand form is preferred and is used throughout this guide when referring to the type of an array.
ja: ２つの書式は機能的に同一であるけれども、短縮形がむしろ好まれ、このガイドを通して配列の型に言及するとき使われます。

source: Although the unary plus operator doesn’t actually do anything, you can use it to provide symmetry in your code for positive numbers when also using the unary minus operator for negative numbers.
ja: 単項プラス演算子は実際に何もしないけれども、あなたは、負の数に単項マイナス演算子を使うときに、正の数に対してもまたあなたのコードで釣り合いを取るためにそれを使うことができます。

source: Although these types, functions, and operators are not part of the Swift language itself, they are used extensively in the discussions and code examples in this part of the book.
ja: これらの型、関数、そして演算子は、スウィフト言語自身の一部ではないけれども、それらは本のこの部分の議論とコード例で広く使用されます。

source: Although they are implemented as computed properties, the names of these properties can be appended to a floating-point literal value with dot syntax, as a way to use that literal value to perform distance conversions.
ja: それらは計算プロパティとして実装されるけれども、これらのプロパティの名前はある浮動小数点リテラル値に、そのリテラル値を距離変換を実行するために使う方法として、ドット構文で追加されることが可能です。

source: Although you can define custom operators that contain a question mark (?), they can’t consist of a single question mark character only.
ja: あなたは疑問符（?）を含むあつらえの演算子を定義できるけれども、それは単一の疑問符文字だけから構成されることはできません。

source: Although you can query the current value of the numberOfEdits property from within another source file, you can’t modify the property from another source file.
ja: あなたは別のソースファイル内からnumberOfEditsプロパティの現在の値についてたずねることができるけれども、あなたは別のソースファイルからこのプロパティを修正できません。

source: Although you write return nil to trigger an initialization failure, you do not use the return keyword to indicate initialization success.
ja: あなたはreturn nilを書くことで初期化失敗を引き起こすけれども、あなたはreturnキーワードを初期化成功を指し示すためには使いません。

source: Always give type parameters upper camel case names (such as T and MyTypeParameter) to indicate that they’re a placeholder for a type, not a value.
ja: それらが、値ではなく、型のためのプレースホルダであることを示すために、型パラメータに常にアッパーキャメルケース名（例えばTやMyTypeParameterなど）を与えてください。

source: Always make sure that an optional contains a non-nil value before using ! to force-unwrap its value.
ja: 必ずあるオプショナルがnilではない値を含むことを、それの値を強制アンラップする!を使う前に確かめてください。

source: Always prefix type property requirements with the static keyword when you define them in a protocol.
ja: あなたがあるプロトコルにおいてそれを定義するとき、常に、型プロパティ要件の前にstaticキーワードを置いてください。

source: Always use a break statement to ignore a switch case.
ja: switchケース節を無視するために、常にbreak文を使ってください。

source: Always use a normal optional type if you need to check for a nil value during the lifetime of a variable.
ja: あなたがある変数の生涯のある時期にnil値について確認する必要があるならば、必ず普通のオプショナル型を使ってください。

source: An Optional-Chaining Expression must appear within a postfix expression.
ja: ひとつのオプショナル連鎖式が、ひとつの接尾辞式の内部に現れなければなりません。

source: An Int8 constant or variable can store numbers between -128 and 127, whereas a UInt8 constant or variable can store numbers between 0 and 255.
ja: Int8定数または変数は、-128と127の間の数を格納することができる一方、UInt8定数または変数は、0と255の間の数を格納することができます。

source: An available attribute that specifies availability using a Swift version number can’t additionally specify a declaration’s platform availability.
ja: スウィフトバージョン数を使って利用可能性を指定しているavailable属性は、ある宣言の持つプラットホーム有効性を追加的に指定することはできません。

source: An if statement is used for executing code based on the evaluation of one or more conditions.
ja: if文は、１つ以上の条件の評価に基づいてコードを実行するために使われます。

source: An available attribute that specifies availability using a Swift version number can’t use the asterisk.
ja: スウィフトバージョン数を使って有効性を指定するavailable属性は、アスタリスクを使用できません。

source: An if statement chained together in this way has the following form:
ja: このやり方で一緒につながれるif文は、以下の形式を持ちます：

source: An array literal is an ordered collection of values.
ja: 配列リテラルは、順序付けられた値のコレクションです。

source: An array stores values of the same type in an ordered list.
ja: 配列は、同じ型の値を順序リストに保管します。

source: An associated type gives a placeholder name to a type that is used as part of the protocol.
ja: 関連型は、プロトコルの一部として使われる型にプレースホルダ名を与えます。

source: An autoclosure is a closure that is automatically created to wrap an expression that’s being passed as an argument to a function.
ja: 自動クロージャは、自動的に作成されて、引数として関数に渡されている式を包み込むクロージャです。

source: An availability condition is used as a condition of an if, while, and guard statement to query the availability of APIs at runtime, based on specified platforms arguments.
ja: 有効性条件は、if、while、そしてguard文の条件として使われて、APIの有効性を実行時に、指定されたプラットホーム引数に基づいて問いただします。

source: An enumeration case pattern matches a case of an existing enumeration type.
ja: 列挙ケース節パターンは、既存の列挙型のケース節にマッチします。

source: An enumeration declaration introduces a named enumeration type into your program.
ja: 列挙宣言は、名前をつけられた列挙型をあなたのプログラムに導入します。

source: An enumeration defines a common type for a group of related values and enables you to work with those values in a type-safe way within your code.
ja: 列挙は、一群の関連した値のための共通の型を定義して、それらの値を型安全な方法であなたのコード内で扱えるようにします。

source: An explicit member expression allows access to the members of a named type, a tuple, or a module.
ja: 明示的メンバー式は、名前付きの型、タプル、またはモジュールのメンバーに対するアクセスを可能にします。

source: An expression pattern represents the value of an expression.
ja: 式パターンは、ある式の値を表します。

source: An extension declaration allows you to extend the behavior of existing types.
ja: 拡張宣言があなたに可能にするのは、既存の型の挙動を拡張することです。

source: An identifier pattern matches any value and binds the matched value to a variable or constant name.
ja: 識別子パターンは、どんな値にでもマッチして、マッチされた値を変数や定数の名前に縛りつけます。

source: An implicit member expression is an abbreviated way to access a member of a type, such as an enumeration case or a type method, in a context where type inference can determine the implied type.
ja: 暗黙のメンバー式は、型推論が暗黙の型を決定することができる前後関係において、例えば列挙のケース節や型メソッドなど、ある型のメンバーにアクセスするための簡略された方法です。

source: An import declaration lets you access symbols that are declared outside the current file.
ja: インポート宣言は、あなたに現在のファイルの外側で宣言されるシンボルにアクセスさせます。

source: An infix operator is a binary operator that is written between its two operands, such as the familiar addition operator (+) in the expression 1 + 2.
ja: 接中辞演算子は、それの２つ演算数の間で書かれる二項演算子です、例えば式1 + 2でのよく知られた加算演算子（+）など。

source: An initializer declaration introduces an initializer for a class, structure, or enumeration into your program.
ja: イニシャライザ宣言は、あなたのプログラムにクラス、構造体、または列挙のためのイニシャライザを導入します。

source: An initializer expression provides access to a type’s initializer.
ja: あなたはまた、スーパークラスのイニシャライザに委任するために、イニシャライザ式を使います。

source: An n-times-table is based on a fixed mathematical rule.
ja: 九九のnの段は、決められた数学的な規則に基づきます。

source: An octal number, with a 0o prefix
ja: ８進数は、接頭辞0oつきで

source: An opaque type defines a type that conforms to a protocol or protocol composition, without specifying the underlying concrete type.
ja: 不透明型は、あるプロトコルまたはプロトコル合成に準拠するある型を定義します、基礎をなす具象型を指定することなしに。

source: An operator declaration introduces a new infix, prefix, or postfix operator into your program and is declared using the operator keyword.
ja: 演算子宣言は、新しい接中辞、接頭辞、または接尾辞演算子をあなたのプログラムに導入します、そしてキーワードoperatorを使って宣言されます。

source: An operator is a special symbol or phrase that you use to check, change, or combine values.
ja: 演算子は、あなたがいろいろな値を調べたり、変えたり、結合したりするために使う、特別な記号または語句です。

source: An optional pattern matches values wrapped in a some(Wrapped) case of an Optional<Wrapped> enumeration.
ja: オプショナルパターンは、Optional<Wrapped>列挙のSome(Wrapped)ケース節でラップされる値にマッチします。

source: An optional-chaining expression provides a simplified syntax for using optional values in postfix expressions.
ja: オプショナル連鎖式は、オプショナルの値を使うために単純化された構文を接尾辞式において提供します。

source: An optional-try expression consists of the try? operator followed by an expression that can throw an error.
ja: オプショナルtry式は、try?演算子と後につづくエラーをスローできる１つの式から成ります。

source: An HTTP status code is a special value returned by a web server whenever you request a web page.
ja: HTTP状態コードは、あなたがウェブ・ページを要請するときはいつでもウェブ・サーバーによって返されるある特別な値です。

source: An access is instantaneous if it’s not possible for other code to run after that access starts but before it ends.
ja: あるアクセスは、もしそのアクセスが始まった後でしかしそれが終わる前に他のコードに実行が可能でないならば、即時的です。

source: An arbitrary Unicode scalar value, written as \u{n}, where n is a 1–8 digit hexadecimal number (Unicode is discussed in Unicode below)
ja: 随意のユニコードスカラー値、\u{n}のように書かれます、ここでnは1–8桁の16進数です（ユニコードは下のUnicodeで議論されます）

source: An array allows new items to be inserted and removed at any location in the array.
ja: 配列は、新しい項目を差し込まれたり取り外除かれることがその配列のどんな場所においても許されます。

source: An array literal is written as a list of values, separated by commas, surrounded by a pair of square brackets:
ja: 配列リテラルは、一対の角括弧に囲まれて、コンマで区切られる値のリストとして書かれます：

source: An arrow (→) is used to mark grammar productions and can be read as “can consist of.”
ja: 矢印（→）を使って文法導出を示します、「その文法はこうしたものから成り立つことができる」と読まれることができます。

source: An assertion is triggered if you try to access a subscript that is outside of the matrix bounds:
ja: あなたがマトリックス境界の外にある添え字にアクセスしようとするならば、表明が引き起こされます：

source: An associated type provides an alias for a type that is used as part of a protocol’s declaration.
ja: 関連型は、エイリアスをプロトコルの宣言の一部として使われる型のために用意します。

source: An attribute provides additional information about the declaration or type.
ja: 属性は、宣言または型についての追加的な情報を提供します。

source: An autoclosure lets you delay evaluation, because the code inside isn’t run until you call the closure.
ja: 自動クロージャは、あなたに評価を延期させます、内部のコードはあなたがそのクロージャを呼び出すまで実行されないからです。

source: An availability condition has the following form:
ja: 有効性条件は以下の形式を持ちます：

source: An eight-bit number has seven value bits, so this means 2 to the power of 7, or 128.
ja: ８ビットの数は７つの値ビットを持ちますので、これは2の7乗、つまり128を意味します。

source: An element name consists of an identifier followed immediately by a colon (:).
ja: 要素名は、識別子に直ちにコロン（：）が続くものから成ります。

source: An empty dictionary literal is written as a colon inside a pair of brackets ([:]) to distinguish it from an empty array literal.
ja: 空の辞書リテラルは、一対の角括弧の中のコロン（[:]）として書かれることで、空の配列リテラルからそれを区別します。

source: An enclosing function can also return one of its nested functions to allow the nested function to be used in another scope.
ja: 囲んでいる関数は、また、入れ子にされた関数が別のスコープにおいて使われるのを許可するために、その入れ子にされた関数のうちの１つを返すことができます。

source: An enumeration case pattern also matches values of that case wrapped in an optional.
ja: 列挙ケースパターンはまた、オプショナルの中にラップされたそのケース節の値それらにマッチします。

source: An enumeration marked usableFromInline can use only types that are public or usableFromInline for the raw values and associated values of its cases.
ja: usableFromInlineで印される列挙は、生の値およびそれの列挙節の関連値に対してパブリックまたはusableFromInlineである型のみに使用できます。

source: An enumeration that is marked with the indirect modifier can contain a mixture of cases that have associated values and cases those that don’t.
ja: indirect修飾子で印される列挙は、関連値を持つケース節とそうでないケース節の入り交じったものを持つことができます。

source: An explicit spelling of unowned.
ja: unownedの明確なつづり方。

source: An extended grapheme cluster is a sequence of one or more Unicode scalars that (when combined) produce a single human-readable character.
ja: ある拡張書記素クラスタは１つ以上のユニコード・スカラーの連なりです、それは（組み合わされて）人間の読み取り可能な１つの文字を作り出します。

source: An extension can be used to extend an existing generic type, as described in Extending a Generic Type.
ja: 拡張は、既存の総称体型を拡張するために使われることができます、総称体型を拡張するで記述されるように。

source: An extension can extend an existing type to make it adopt one or more protocols.
ja: 拡張は、既存の型を拡張して、それが１つ以上のプロトコルを採用するようにできます。

source: An implementation of subscript(dynamicMemberLookup:) can accept key paths using an argument of type KeyPath [https://developer.apple.com/documentation/swift/keypath], WritableKeyPath [https://developer.apple.com/documentation/swift/writablekeypath], or ReferenceWritableKeyPath [https://developer.apple.com/documentation/swift/referencewritablekeypath].
ja: subscript(dynamicMemberLookup:)の実装はキーパスを、型KeyPath [https://developer.apple.com/documentation/swift/keypath]、WritableKeyPath [https://developer.apple.com/documentation/swift/writablekeypath]、またはReferenceWritableKeyPath [https://developer.apple.com/documentation/swift/referencewritablekeypath]の引数を使って受け入れ可能です。

source: An implicitly unwrapped optional is a normal optional behind the scenes, but can also be used like a non-optional value, without the need to unwrap the optional value each time it’s accessed.
ja: 暗黙的にアンラップされるオプショナルは、舞台裏では普通のオプショナルです、しかしまたオプショナルでない値のように扱うこともできます、それがアクセスされるたびにオプショナルの値をアンラップする必要はありません。

source: An in-out parameter has a value that is passed in to the function, is modified by the function, and is passed back out of the function to replace the original value.
ja: in-outパラメータはある値を持ち、それは関数の中に渡されて、その関数によって修正されて、それから逆にその関数の外に渡されて本来の値に取って代わります。

source: An indirect case must have an associated value.
ja: 関節参照のケース節は、関連値を持っていなければなりません。

source: An initializer cannot call any instance methods, read the values of any instance properties, or refer to self as a value until after the first phase of initialization is complete.
ja: イニシャライザは、初期化の最初の段階が完了するまで、どんなインスタンスメソッドも呼ぶこと、どんなインスタンスプロパティの値も読むこと、またはselfをひとつの値として参照することができません。

source: An instance method can be called only on a specific instance of the type it belongs to.
ja: インスタンスメソッドは、それが属している型のある特定のインスタンスでだけ呼ばれることができます。

source: An instance method has implicit access to all other instance methods and properties of that type.
ja: あるインスタンスメソッドは、無条件にその型の他のインスタンスメソッドとプロパティの全てへのアクセスを持ちます。

source: An instance of Hoverboard uses the default number of wheels supplied by the Vehicle initializer.
ja: Hoverboardのインスタンスは、Vehicleイニシャライザによって提供される省略時の車輪数を使います。

source: An instance of a class is traditionally known as an object.
ja: クラスのインスタンスは、伝統的にオブジェクトとして知られています。

source: An integer type can be initialized with a Double or Float value:
ja: 整数型は、DoubleまたはFloat値で初期化されることができます：

source: An opaque type lets the function implementation pick the type for the value it returns in a way that’s abstracted away from the code that calls the function.
ja: ある不透明型は、関数実装に、それが返す値に対する型を、その関数を呼び出すコードから離れて抽象化されるある方法で選択させます。

source: An opaque type refers to one specific type, although the caller of the function isn’t able to see which type; a protocol type can refer to any type that conforms to the protocol.
ja: 不透明型は１つの特定の型を参照します、とはいえ関数の呼び出し側はどの型か知ることができません；プロトコル型はそのプロトコルに準拠するどんな型でも参照できます。

source: An optional Int is written as Int?, not Int.
ja: オプショナルのIntは、Int?のように書かれます、Intではなく。

source: An optional protocol requirement can be called with optional chaining, to account for the possibility that the requirement was not implemented by a type that conforms to the protocol.
ja: オプショナルのプロトコル要件は、オプショナル連鎖を使って呼び出されることができます、それによってプロトコルに準拠する型によって要件が満たされなかったという可能性に対応します。

source: An optional represents two possibilities: Either there is a value, and you can unwrap the optional to access that value, or there isn’t a value at all.
ja: あるオプショナルは２つの可能性を表します：ある値が存在する、するとあなたはそのオプショナルをアンラップすることでその値を利用できます、または値がそもそも存在しないかのいずれか。

source: An optional tuple type such as (Int, Int)? is different from a tuple that contains optional types such as (Int?, Int?).
ja: (Int, Int)?のようなオプショナルタプル型は、(Int?, Int?)のようなオプショナル型を含むタプルとは異なる方式です。

source: An optional value either contains a value or contains nil to indicate that a value is missing.
ja: オプショナルの値は、ある値を含むか、値が見つからないことを示すnilを含むかのどちらかです。

source: An optional variable is used here, because players can leave the game at any point.
ja: オプショナルの変数がここで使われます、なぜなら、プレーヤーはどの時点でもゲームから離れることができるからです。

source: An overridden method named someMethod() can call the superclass version of someMethod() by calling super.someMethod() within the overriding method implementation.
ja: someMethod()という名前のオーバーライドされたメソッドは、オーバーライドしているメソッド実装内でsuper.someMethod()を呼ぶことによって、スーパークラス版のsomeMethod()を呼ぶことができます。

source: An overridden property called someProperty can access the superclass version of someProperty as super.someProperty within the overriding getter or setter implementation.
ja: somePropertyと呼ばれるオーバーライドされたプロパティは、オーバーライドしているゲッターまたはセッター実装内で、super.somePropertyのようにしてスーパークラス版のsomePropertyにアクセスすることができます。

source: An overridden subscript for someIndex can access the superclass version of the same subscript as super[someIndex] from within the overriding subscript implementation.
ja: someIndexのためのオーバーライドされた添え字は、オーバーライドしている添え字実装内からsuper[someIndex]のようにしてスーパークラス版の同じ添え字にアクセスすることができます。

source: An override can make an inherited class member more accessible than its superclass version.
ja: オーバーライドは、継承されたクラス・メンバーを、そのスーパークラス版よりもアクセス度を高くすることができます。

source: An underscore (_) before a parameter name suppresses the argument label.
ja: パラメーター名の前のアンダースコア（_）は、引数ラベルを抑制します。

source: An underscore (_) parameter is explicitly ignored and can’t be accessed within the body of the function.
ja: ひとつのアンダースコア（_）のパラメータは、明確に無視されます、そして関数の本体内でアクセスされることができません。

source: An unowned reference is expected to always have a value.
ja: 非所有参照は、常にある値を持っていることを期待されます。

source: An unowned reference is the appropriate capture method to use to resolve the strong reference cycle in the HTMLElement example from Strong Reference Cycles for Closures above.
ja: 非所有参照は、上のクロージャのための強い参照循環のHTMLElement例での強い参照循環を解消するのために使うのに適切な捕獲の手法です。

source: And SomeProtocol.self returns SomeProtocol itself, not an instance of a type that conforms to SomeProtocol at runtime.
ja: そして、SomeProtocol.selfは、SomeProtocol自身を返します、実行時にSomeProtocolに準拠するある型のインスタンスではなく。

source: And because the value of ExampleEnum.c is explicitly set to 5, the value of ExampleEnum.d is automatically incremented from 5 and is therefore 6.
ja: そしてExampleEnum.cの値が明示的に5に設定されるので、ExampleEnum.dの値は5から自動的に増加して、したがって6です。

source: And just like functions and methods, you use the throws or rethrows keyword after an initializer’s parameters to indicate the appropriate behavior.
ja: そして関数やメソッドのように、あなたはthrowsまたはrethrowsキーワードをイニシャライザのパラメータの後に使って、ふさわしい挙動を指し示すことができます。

source: And just like functions, you can get a reference to an enumeration case and apply it later in your code.
ja: さらにまさに関数のように、あなたはある列挙ケース節の参照を得ることができ、それを後であなたのコードに応用することができます。

source: And so on.
ja: などなど。

source: And, because weak references need to allow their value to be changed to nil at runtime, they are always declared as variables, rather than constants, of an optional type.
ja: そしてまた、弱い参照はそれらの値を実行時にnilに変更されるのを許される必要があることから、それらは常にオプショナル型の変数として宣言されます、定数ではなく。

source: Another choice for enumeration cases is to have values associated with the case—these values are determined when you make the instance, and they can be different for each instance of an enumeration case.
ja: 列挙ケース節の別の選択はそのケース節と結びつけられる値を持つことになります — それらの値はあなたがインスタンスを作る時に決定されます、そしてそれらはある列挙ケース節のインスタンスそれぞれで異なることができます。

source: Another consequence of long-term write access to in-out parameters is that passing a single variable as the argument for multiple in-out parameters of the same function produces a conflict.
ja: in-outパラメータに対する長期書き込みアクセスの別の帰着は、同じ関数の複数in-outパラメータのための引数として単一の変数を渡すことが衝突を生み出すことです。

source: Another problem with this approach is that the shape transformations don’t nest.
ja: この取り組みの別の問題は、形状変換が入れ子にされないことです。

source: Another way to handle errors is to use try? to convert the result to an optional.
ja: エラーを取り扱う別の方法は、try?を使って結果をオプショナルに変換することです。

source: Another way to handle optional values is to provide a default value using the ?? operator.
ja: オプショナルの値を取り扱うもう１つの方法は、省略時の値を??演算子を使って提供することです。

source: Any Dice instance can now be treated as TextRepresentable:
ja: どんなDiceインスタンスでも、今やTextRepresentableとして扱われることができます：

source: Any Unicode scalar value except ", \, U+000A, or U+000D
ja: 何らかのユニコードスカラー値、しかし", \、U+000A、またはU+000Dを除く

source: Any Unicode scalar value except /* or */
ja: 任意のユニコードスカラー値、 しかし/* または */ を除く

source: Any Unicode scalar value except \
ja: 任意のユニコードスカラー値、しかし\を除く

source: Any Unicode scalar value except U+000A or U+000D
ja: 任意のユニコードスカラー値、 しかし U+000A または U+000D を除く

source: Any additional setup work that uses methods, getters, or setters can also be done at this point.
ja: メソッド、ゲッター、またはセッターを使うどんな追加の準備作業も、また、この時点で行われることができます。

source: Any attempt to override a final method, property, or subscript in a subclass is reported as a compile-time error.
ja: あるサブクラスの中の最終的なメソッド、プロパティ、または添え字をオーバーライドするどんな試みも、コンパイル時エラーとして報告されます。

source: Any attempt to set a property through optional chaining returns a value of type Void?, which enables you to compare against nil to see if the property was set successfully:
ja: オプショナル連鎖を通してプロパティを設定しようとするあらゆる試みは、型Void?の値を返します、それは、あなたにnilと比較することでそのプロパティがうまく設定されたかどうか調べることを可能にします。

source: Any attempt to subclass a final class is reported as a compile-time error.
ja: 最終版クラスにサブクラスを作る試みは何であれ、コンパイル時エラーを報告します。

source: Any bits that are moved beyond the bounds of the integer’s storage are discarded.
ja: 整数の格納量の境界を越えて動かされるあらゆるビットは、捨てられます。

source: Any class that does not inherit from another class is known as a base class.
ja: 別のクラスから継承しない何らかのクラスは、基盤クラスとして知られています。

source: Any constants or variables assigned a value from an optional binding declaration in a guard statement condition can be used for the rest of the guard statement’s enclosing scope.
ja: guard文条件の中のオプショナル束縛宣言由来のあらゆる定数または変数は、guard文の囲むスコープの他の部分で使われることができます。

source: Any errors thrown inside a nonthrowing function must be handled inside the function.
ja: スローしない関数の内部でスローされるどんなエラーも、その関数の内部で取り扱われなければなりません。

source: Any function that you write as just one return line can omit the return.
ja: あなたがただ１つだけのreturn行として書くあらゆる関数は、returnを省略できます。

source: Any gaps in an array are closed when an item is removed, and so the value at index 0 is once again equal to "Six eggs":
ja: 項目が取り外されるとき、配列でのどんな隙間でも閉じられます、なのでインデックス0での値はふたたび"Six eggs"と等しいです：

source: Any identifier, keyword, literal, or operator
ja: 任意の識別子、キーワード、リテラル、または演算子

source: Any initializer in the diagram above can be used to create a fully initialized instance of the class they belong to.
ja: 上の図の中のどんなイニシャライザでも、それらが属しているクラスの充分に初期化されたインスタンスをつくるために使用されることができます。
